tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI tools
brew "git"
brew "wget"
brew "curl"
brew "htop"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "gh"
brew "tmux"
brew "git-delta"
brew "tree"
brew "openssl@3"
brew "gnupg"
brew "node"
brew "python"
brew "yarn"
brew "pnpm"
brew "mas"
brew "neovim"
brew "git-lfs"
brew "shfmt"
brew "thefuck"
brew "starship"

# Editors / Dev UX
cask "visual-studio-code"
cask "cursor"

# Containers / Cloud
cask "docker"
cask "gcloud-cli"
cask "google-cloud-sdk"

# Security / Passwords
cask "1password-cli"

# Alternative Browsers / Privacy
cask "eloston-chromium"
cask "ungoogled-chromium"

# Fonts
cask "font-maple-mono"
cask "font-maple-mono-nf"

# Browsers (multiple Chrome channels)
cask "google-chrome"
cask "google-chrome@canary"
cask "google-chrome@dev"
cask "google-chrome@beta"
cask "firefox"

# Productivity / Terminal / Tools
cask "ghostty"

# Communication
cask "slack"

# (Optional) App Store installs via mas:
# mas "Xcode", id: 497799835
